app/Http/Controllers/ContactsController.php

    public function index(): Response{
        $user = Auth::user();
        $contacts = Contacts::all();
---
select * from "contact"

    public function store(ContactRequest $request):RedirectResponse{
        $contact = $request->validated();
        $contact['user_id'] = auth()->id();

        DB::beginTransaction();
        try {
            Contacts::create($contact);
---
insert into "contact" ("name", "phone", "email", "address", "user_id", "image_path", "updated_at", "created_at") values ('Jhoni', '939921981981', 'jhoni@teste.com', 'Rua C', 3, 'https://res.cloudinary.com/deaanhyrx/image/upload/v1720922376/k42vffipmfljptwzzmln.png', '2024-07-14 01:59:35', '2024-07-14 01:59:35') returning "id"

    public function edit($id):Response
    {
        $contact = Contacts::findOrFail($id);
---
select * from "contact" where "contact"."id" = '1' limit 1

    public function update(ContactRequest $request, $id): RedirectResponse
    {
        $contactData = $request->validated();
        DB::beginTransaction();
        try {
            $contact = Contacts::findOrFail($id);
            $contact->update($contactData);
---
select * from "contact" where "contact"."id" = '8' limit 1
update "contact" set "name" = 'asdasdasd', "phone" = 'asdads', "email" = 'asdads', "address" = 'asddas', "updated_at" = '2024-07-13 23:00:43' where "id" = 8

    public function destroy($id): RedirectResponse
    {
        $contact = Contacts::findOrFail($id);

        DB::beginTransaction();
        try {
            $contact->delete();
---
select * from "contact" where "contact"."id" = '1' limit 1
delete from "contact" where "id" = 1